nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso55s69/driver_examples/plu/combination/cm33_core0/pin_mux.h
/*
 * Copyright 2017-2019 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Enables digital function */
#define IOCON_PIO_DIGITAL_EN 0x0100u
/*!
 * @brief Selects pin function 1 */
#define IOCON_PIO_FUNC1 0x01u
/*!
 * @brief Input function is not inverted */
#define IOCON_PIO_INV_DI 0x00u
/*!
 * @brief No addition pin function */
#define IOCON_PIO_MODE_INACT 0x00u
/*!
 * @brief Open drain is disabled */
#define IOCON_PIO_OPENDRAIN_DI 0x00u
/*!
 * @brief Standard mode, output slew rate control is enabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_16_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 2. */
#define PIO0_16_FUNC_ALT2 0x02u
/*!
 * @brief
 * Analog switch input control.
 * : For pins PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9, analog switch is closed
 * (enabled).
 * For the other pins, analog switch is open (disabled).
 */
#define PIO0_18_ASW_VALUE0 0x00u
/*!
 * @brief
 * Analog switch input control.
 * : For pins PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9, analog switch is closed
 * (enabled).
 * For the other pins, analog switch is open (disabled).
 */
#define PIO0_18_ASW_VALUE1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_18_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_19_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_20_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_21_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_10_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_10_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_18_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 7. */
#define PIO1_18_FUNC_ALT7 0x07u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_19_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 7. */
#define PIO1_19_FUNC_ALT7 0x07u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_20_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 7. */
#define PIO1_20_FUNC_ALT7 0x07u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_4_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_4_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_6_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_6_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_7_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_7_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_8_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_8_FUNC_ALT0 0x00u
/*!
 * @brief
 * Analog switch input control.
 * : For pins PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9, analog switch is closed
 * (enabled).
 * For the other pins, analog switch is open (disabled).
 */
#define PIO1_9_ASW_VALUE0 0x00u
/*!
 * @brief
 * Analog switch input control.
 * : For pins PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9, analog switch is closed
 * (enabled).
 * For the other pins, analog switch is open (disabled).
 */
#define PIO1_9_ASW_VALUE1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_9_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_9_FUNC_ALT0 0x00u

/*! @name PIO0_18 (number 56), PLU_IN3
  @{ */
#define BOARD_INITPINS_PLU_IN3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PLU_IN3_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PLU_IN3_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_19 (number 90), PLU_IN4
  @{ */
#define BOARD_INITPINS_PLU_IN4_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PLU_IN4_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PLU_IN4_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_20 (number 74), PLU_IN5
  @{ */
#define BOARD_INITPINS_PLU_IN5_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PLU_IN5_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PLU_IN5_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_18 (number 64), PLU_OUT0
  @{ */
#define BOARD_INITPINS_PLU_OUT0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PLU_OUT0_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PLU_OUT0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_19 (number 58), PLU_OUT1
  @{ */
#define BOARD_INITPINS_PLU_OUT1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PLU_OUT1_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PLU_OUT1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_20 (number 4), PLU_OUT2
  @{ */
#define BOARD_INITPINS_PLU_OUT2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PLU_OUT2_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PLU_OUT2_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_8 (number 24), GPIO_PLU_IN3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GPIO_PLU_IN3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_GPIO_PLU_IN3_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_GPIO_PLU_IN3_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_GPIO_PLU_IN3_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_GPIO_PLU_IN3_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_9 (number 10), GPIO_PLU_IN4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GPIO_PLU_IN4_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_GPIO_PLU_IN4_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_GPIO_PLU_IN4_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_GPIO_PLU_IN4_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_GPIO_PLU_IN4_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_10 (number 40), GPIO_PLU_IN5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GPIO_PLU_IN5_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_GPIO_PLU_IN5_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_GPIO_PLU_IN5_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_GPIO_PLU_IN5_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_GPIO_PLU_IN5_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO1_4 (number 1), LEDB
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDB_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDB_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDB_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LEDB_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO1_6 (number 5), LEDR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDR_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDR_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LEDR_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDR_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO1_7 (number 9), LEDG
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDG_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDG_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDG_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LEDG_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDG_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
